INTRO = "здравствуйте!\nВам предстоит ответить на 20 билетов экзамена ISTQB.\n" \
        "Как будете готовы приступить к экзамену, отправте любое сообщение."

QUESTION1 = "Какой из следующих ответов описывает тестовое условие?\n" \
            "Варианты ответов:\n" \
            "1) Атрибут компонента или системы, описанный или подразумеваемый в спецификации требований.\n" \
            "2) Часть базиса тестирования, имеющая отношение к достижению конкретной цели тестирования.\n" \
            "3) Степень, в которой программный продукт обеспечивает функции, которые удовлетворяют заявленным и подразумеваемым потребностям во время использования программного обеспечения в определенных условиях.\n" \
            "4) Процент всех отдельных исходов условий, которые независимо влияют на результат альтернативы, проверенной набором тестов."