INTRO = "\nВам предстоит ответить на 40 билетов экзамена ISTQB.\n" \
        "Версия билетов ID:A Version 1.3\n" \
        "Как будете готовы приступить к экзамену, отправте любое сообщение."

QUESTION1 = "Вопрос #1\n" \
    "Какой из следующих ответов описывает тестовое условие?\n\n" \
    "Варианты ответов:\n" \
    "1) Атрибут компонента или системы, описанный или подразумеваемый в спецификации требований.\n" \
    "2) Часть базиса тестирования, имеющая отношение к достижению конкретной цели тестирования.\n" \
    "3) Степень, в которой программный продукт обеспечивает функции, которые удовлетворяют заявленным " \
    "и подразумеваемым потребностям во время использования программного обеспечения в определенных условиях.\n" \
    "4) Процент всех отдельных исходов условий, которые независимо  влияют на результат альтернативы, " \
    "проверенной набором тестов."

QUESTION2 = "Вопрос #2\n" \
    "Какое из следующих утверждений является корректной целью тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени " \
    "на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION3 = "Вопрос #3\n" \
    "Какое из следующих утверждений корректно описывает разницу между тестированием и отладкой?\n\n" \
    "Варианты ответов:\n" \
    "1) Тестирование определяет причину дефектов; отладка анализирует дефекты и предлагает меры по их предотвращению.\n" \
    "2) Динамическое тестирование показывает отказы, вызванные дефектами; отладка находит, " \
    "анализирует и устраняет причины отказов ПО.\n" \
    "3) Тестирование устраняет дефекты; отладка определяет причины отказов.\n" \
    "4) Динамическое тестирование предотвращает причины отказов; отладка устраняет отказы."

QUESTION4 = "Вопрос #4\n" \
    "Какое из следующих утверждений описывает наиболее частую ситуацию при обнаружении отказа во время тестирования " \
    "или в процессе эксплуатации?\n\n" \
    "Варианты ответов:\n" \
    "1) В продукте возникает сбой/отказ, когда пользователь выбирает опцию в диалоговом окне.\n" \
    "2) В сборку была включена неверная версия скомпилированного исходного кода.\n" \
    "3) В алгоритме вычислений использованы неверные входные переменные.\n" \
    "4) Разработчик неверно понял требования к алгоритму."

QUESTION5 = "Вопрос #5\n" \
    "Тестировщик тестирует приложения на мобильных устройствах в течение 5 лет. Он имеет" \
    "большой опыт тестирования мобильных приложений и достигает лучших результатов быстрее," \
    "чем другие. В течение нескольких месяцев этот тестировщик не изменял существующие" \
    "автоматизированные тестовые сценарии и не создавал новые. Это приводит к уменьшению" \
    "количества обнаруживаемых дефектов при выполнении тестов. Какой принцип тестирования не" \
    "соблюдает этот тестировщик?\n\n" \
    "Варианты ответов:\n" \
    "1) Тестирование зависит от окружения.\n" \
    "2) Исчерпывающее тестирование невозможно.\n" \
    "3) Повторение тестов не вскроет новые дефекты.\n" \
    "4) Дефекты «кластеризуются»."

QUESTION6 = "Вопрос #6\n" \
    "В каком смысле тестирование является частью обеспечения качества?\n\n" \
    "Варианты ответов:\n" \
    "1) Тестирование проверяет, что требования достаточно детализированы.\n" \
    "2) Тестирование способствует достижению качества различными способами.\n" \
    "3) Тестирование проверяет, что стандарты организации соблюдаются.\n" \
    "4) Тестирование измеряет качество ПО количеством выполненных тестовых сценариев."

QUESTION7 = "Вопрос #7\n" \
    "Какая из следующих активностей является частью «анализа тестирования» в процессе тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Идентификация всей необходимой инфраструктуры и инструментов.\n" \
    "2) Создание наборов тестов из автоматизированных тестовых сценариев.\n" \
    "3) Анализ полученных знаний для улучшения процесса.\n" \
    "4) Оценка базиса тестирования на тестируемость."

QUESTION8 = "Вопрос #8\n" \
    "Сопоставьте следующие рабочие продукты тестирования (1-4) с их корректным описанием (A-D)\n" \
    "1. Набор тестов\n" \
    "2. Тестовый сценарий\n" \
    "3. Автоматизированный тестовый сценарий\n" \
    "4. Концепция тестирования\n\n" \
    "A. Комплект автоматизированных тестовых сценариев с последовательностью инструкций\n" \
    "B. Набор инструкций для выполнения теста\n" \
    "C. Содержит ожидаемые результаты\n" \
    "D. Изложение целей тестирования и, возможно, идей относительно процесса тестирования\n\n" \
    "Варианты ответов:\n" \
    "1) 1A, 2C, 3B, 4D.\n" \
    "2) 1D, 2B, 3A, 4C.\n" \
    "3) 1A, 2C, 3D, 4B.\n" \
    "4) 1D, 2C, 3B, 4A."

QUESTION9 = "Вопрос #9\n" \
    "Как тестирование белого ящика может быть применено в приемочном тестировании?\n\n" \
    "Варианты ответов:\n" \
    "1)  Для проверки возможности передачи больших объемов данных между интегрируемыми системами.\n" \
    "2) Для проверки того, были ли выполнены все выражения и альтернативы в коде.\n" \
    "3) Для проверки того, что все ветки процесса были покрыты.\n" \
    "4) Для покрытия всей навигации на веб-странице."

QUESTION10 = "Вопрос #10\n" \
    "Какое из следующих сравнений компонентного и системного тестирования КОРРЕКТНО?\n\n" \
    "Варианты ответов:\n" \
    "1) Компонентное тестирование проверяет функциональность программных" \
    "модулей, программных объектов и классов, которые могут тестироваться" \
    "отдельно, тогда как системное тестирование проверяет интерфейсы между" \
    "компонентами и взаимодействие между различными частями системы.\n" \
    "2) Тестовые сценарии для компонентного тестирования обычно получают из" \
    "спецификаций компонентов, проектных спецификаций или моделей данных," \
    "тогда как тестовые сценарии для системного тестирования обычно получают из" \
    "спецификаций требований или сценариев использования системы.\n" \
    "3) Компонентное тестирование фокусируется только на функциональных" \
    "характеристиках, тогда как системное тестирование фокусируется на" \
    "функциональных и нефункциональных характеристиках.\n" \
    "4) Компонентное тестирование является обязанностью тестировщиков, тогда как" \
    "системное тестирование обычно является обязанностью пользователей системы."

QUESTION11 = "Вопрос #11\n" \
    "Что из следующего КОРРЕКТНО?\n\n" \
    "Варианты ответов:\n" \
    "1) Целью регрессионного тестирования является проверка того, было ли исправление успешно выполнено, " \
    "а целью подтверждающего тестирования является подтверждение того, что исправление не имеет побочных эффектов.\n" \
    "2) Целью регрессионного тестирования является обнаружение непреднамеренных побочных эффектов, " \
    "а целью подтверждающего тестирования является проверка того, работает ли система в новом окружении.\n" \
    "3) Целью регрессионного тестирования является обнаружение непреднамеренных побочных эффектов, " \
    "в то время как целью подтверждающего тестирования является проверка того, был ли исправлен исходный дефект.\n" \
    "4) Целью регрессионного тестирования является проверка работоспособности новой функциональности, " \
    "а целью подтверждающего тестирования - проверка исправления исходного дефекта."

QUESTION12 = "Вопрос #12\n" \
    "Что из следующего ЛУЧШЕ ВСЕГО описывает инкрементную модель разработки?\n\n" \
    "Варианты ответов:\n" \
    "1) Определение требований, проектирование ПО и тестирование выполняются поэтапно, " \
    "где на каждом этапе добавляется фрагмент системы.\n" \
    "2) Фаза в процессе разработки должна начинаться, когда предыдущая фаза завершена.\n" \
    "3) Тестирование рассматривается как отдельная фаза, которая происходит после завершения разработки.\n" \
    "4) Тестирование добавляется в разработку в качестве приращения."

QUESTION13 = "Вопрос #13\n" \
    "Что из следующего НЕ должно быть триггером для тестирования сопровождения?\n\n" \
    "Варианты ответов:\n" \
    "1) Решение протестировать сопровождаемость ПО.\n" \
    "2) Решение протестировать систему после миграции на новую операционную платформу.\n" \
    "3) Решение протестировать, возможно ли восстановить заархивированные данные.\n" \
    "4) Решение протестировать быстрое исправление («хот фикс»)."

QUESTION14 = "Вопрос #14\n" \
    "Какие из следующих опций являются ролями в формальном рецензировании?\n\n" \
    "Варианты ответов:\n" \
    "1) Разработчик, Координатор, Лидер рецензирования, Тестировщик.\n" \
    "2) Автор, Координатор, Руководитель, Разработчик.\n" \
    "3) Автор, Руководитель, Лидер рецензирования, Проектировщик.\n" \
    "4) Автор, Координатор, Лидер рецензирования, Секретарь."

QUESTION15 = "Вопрос #15\n" \
    "Какие активности выполняются во время планирования формального рецензирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Сбор метрик для оценки эффективности рецензирования.\n" \
    "2) Ответы на любые вопросы участников.\n" \
    "3) Проверка критериев входа для рецензирования.\n" \
    "4) Оценка результатов рецензирования на соответствие критериям выхода."

QUESTION16 = "Вопрос #16\n" \
    "Какой из следующих типов рецензирования является НАИЛУЧШИМ, если рецензирование должно следовать " \
    "формальному процессу на основе правил и чек-листов?\n\n" \
    "Варианты ответов:\n" \
    "1) Неформальное рецензирование.\n" \
    "2) Технический анализ.\n" \
    "3) Инспекция.\n" \
    "4) Разбор."

QUESTION17 = "Вопрос #17\n" \
    "Какие ДВА из следующих утверждений о статическом тестировании НАИБОЛЕЕ корректны?\n\n" \
    "Варианты ответов:\n" \
    "1) Статическое тестирование – это дешевый способ поиска и устранения дефектов.\n" \
    "2) Статическое тестирование делает динамическое тестирование менее сложным.\n" \
    "3) Статическое тестирование позволяет рано проверять пользовательские требования.\n" \
    "4) Статическое тестирование позволяет находить рано в жизненном цикле проблемы при выполнении ПО.\n" \
    "5) При тестировании системы с особыми требованиями к обеспечению безопасности статическое тестирование имеет " \
    "меньшую ценность, поскольку динамическое тестирование находит дефекты лучше.\n" \
    "Выберите ДВА варианта."

QUESTION18 = "Вопрос #18\n" \
    "Вас пригласили принять участие в рецензировании. Рецензируемый рабочий продукт представляет собой " \
    "описание процесса создания внутреннего документа. " \
    "Целью документа является представление распределения работ между" \
    "различными ролями, участвующими в процессе, таким образом, чтобы это было понятно каждому." \
    "Рецензирование будет проходить на основе чек-листа, который будет вам выслан.\n" \
    "Чек-лист включает в себя следующие пункты:\n" \
    "i. Для каждой активности, точно ли определен сотрудник, который ее выполняет?\n" \
    "ii. Четко ли определены критерии входа для каждой активности?\n" \
    "iii. Четко ли определены критерии выхода для каждой активности?\n" \
    "iv. Для каждой активности, четко ли определены вспомогательные роли и их области ответственности?\n\n" \
    "Ниже представлена выдержка из результатов работы, которую необходимо прорецензировать,\n" \
    "для чего вы должны использовать упомянутый выше чек-лист:\n" \
    "«После проверки клиентской документации на полноту и правильность архитектор ПО создает спецификацию системы.\n" \
    "После того как архитектор ПО завершил создание спецификации системы, он приглашает принять участие" \
    "в рецензировании тестировщиков и других рецензентов. Чек-лист описывает область рецензирования.\n" \
    "Каждый приглашенный рецензент при необходимости создает комментарии, " \
    "и завершает рецензирование комментарием об официальном завершении.\n" \
    "\n\n" \
    "Какое из следующих утверждений о вашем рецензировании корректно?\n" \
    "Варианты ответов:\n" \
    "1) Пункт ii) чек-листа был нарушен, поскольку неясно, какое условие должно быть выполнено, " \
    "чтобы пригласить к рецензированию..\n" \
    "2) Вы замечаете, что в дополнение к тестировщику и верификатору, также должен быть приглашен валидатор. " \
    "Поскольку этот элемент не является частью вашего чек-листа, вы не создадите соответствующий комментарий..\n" \
    "3) Пункт iii) чек-листа был нарушен, так как неясно, что помечает проверку как завершенную.\n" \
    "4) Пункт i) чек-листа был нарушен, потому что неясно, кто предоставляет чек-лист для приглашения на рецензирование."

QUESTION19 = "Вопрос #19\n" \
    "Что такое тестирование на основе чек-листов?\n\n" \
    "Варианты ответов:\n" \
    "1) Метод создания тестов, в котором тесты создаются на основе знаний тестировщика о предыдущих недочетах " \
    "или общих знаниях об отказах..\n" \
    "2) Процедура получения и/или выбора тестовых сценариев на основе анализа функциональной " \
    "или нефункциональной спецификации компонента или системы без ссылки на их внутреннюю структуру.\n" \
    "3) Метод создания тестов, основанный на опыте, при котором опытный тестировщик использует список, " \
    "содержащий пункты, которые нужно отметить или запомнить, или состоит из набора правил или критериев, " \
    "согласно которым верифицируется программный продукт.\n" \
    "4) Подход к тестированию, при котором тестировщики динамически разрабатывают и выполняют тесты, " \
    "основываясь на своих знаниях, изучая элемент тестирования и результаты предыдущих тестов."

QUESTION20 = "Вопрос #20\n" \
    "Какой один из следующих пунктов относится к методу черного ящика?\n\n" \
    "Варианты ответов:\n" \
    "1) Метод, основанный на анализе архитектуры.\n" \
    "2) Метод, проверяющий, что объект тестирования работает согласно техническому проекту..\n" \
    "3) Метод, основанный на знаниях о предыдущих недочетах или общих знаниях об отказах.\n" \
    "4) Метод, основанный на формальных требованиях."

QUESTION21 = "Вопрос #21\n" \
    "Следующее утверждение относится к покрытию альтернатив:" \
    "«Когда код содержит только один оператор «if» и никаких циклов или операторов CASE, " \
    "и его выполнение при проведении тестирования не является вложенным в другой оператор, " \
    "любой выполняемый нами тестовый сценарий приведет к 50% покрытию альтернатив». " \
    "Какое из следующих утверждений является корректным?\n\n" \
    "Варианты ответов:\n" \
    "1) Утверждение верное. Любой отдельный тестовый сценарий обеспечивает 100% покрытие операторов " \
    "и поэтому 50% покрытие альтернатив.\n" \
    "2) Утверждение верное. Любой отдельный тестовый сценарий может привести к тому, " \
    "что результат оператора «if» будет истинным или ложным.\n" \
    "3) Утверждение ложное. Один тестовый сценарий может гарантировать только 25% покрытие альтернатив в этом случае.\n" \
    "4) Утверждение ложное. Утверждение слишком широкое. Оно может быть верно или нет " \
    "в зависимости от тестируемого программного обеспечения."

QUESTION22 = "Вопрос #22\n" \
    "Что из следующего является описанием покрытия операторов?\n\n" \
    "Варианты ответов:\n" \
    "1) Это метрика, отражающая процент выполненных тестовых сценариев.\n" \
    "2) Это метрика, отражающая процент выполненных операторов в исходном коде.\n" \
    "3) Это метрика, отражающая число выполненных операторов в исходном коде во время выполнения тестовых сценариев.\n" \
    "4) Это метрика, дающая подтверждение истинности/ложности того, что все операторы были покрыты."

QUESTION23 = "Вопрос #23\n" \
    "Какое утверждение о связи между покрытием операторов и покрытием альтернатив является верным?\n\n" \
    "Варианты ответов:\n" \
    "1) 100% покрытие альтернатив также гарантирует 100% покрытие операторов.\n" \
    "2) 100% покрытие операторов также гарантирует 100% покрытие альтернатив.\n" \
    "3) 50% покрытие альтернатив также гарантирует 50% покрытие операторов.\n" \
    "4) 100% покрытие альтернатив не может быть достигнуто."

QUESTION24 = "Вопрос #24\n" \
    "Для какой из следующих ситуаций подходит исследовательское тестирование?\n\n" \
    "Варианты ответов:\n" \
    "1) Когда нехватка времени требует ускорения выполнения уже написанных тестов.\n" \
    "2) Когда система разрабатывается инкрементно и доступна концепция тестирования.\n" \
    "3) Когда есть тестировщики, которые имеют достаточные знания о похожих приложениях и технологиях.\n" \
    "4) Когда уже существуют достаточные знания о системе и должны быть предоставлены доказательства того, " \
    "что она должна подвергнуться интенсивному тестированию."

QUESTION25 = "Вопрос #25\n" \
    "Рассчитывается бонус сотрудника. Он не может быть отрицательным, но может быть нулевым. " \
    "Бонус основан на стаже работы:\n" \
    "• меньше или равен 2 годам,\n" \
    "• более 2 лет, но менее 5 лет,\n" \
    "• от 5 до 10 лет включительно или дольше 10 лет.\n" \
    "Какое минимальное количество тестовых сценариев требуется для покрытия всех действительных" \
    "классов эквивалентности для расчета бонуса?\n\n" \
    "Варианты ответов:\n" \
    "1) 3.\n" \
    "2) 5.\n" \
    "3) 2.\n" \
    "4) 4."

QUESTION26 = "Вопрос #26\n" \
    "Система контроля скорости имеет следующие характеристики:" \
    "Если вы едете со скоростью 50 км/ч или меньше, ничего не произойдет.\n" \
    "Если вы едете быстрее 50 км/ч, но не более 55 км/ч, вы будете предупреждены.\n" \
    "Если вы едете быстрее 55 км/ч, но не более 60 км/ч, вас оштрафуют.\n" \
    "Если вы едете быстрее 60 км/ч, вы будете лишены водительских прав на определенный срок.\n" \
    "Скорость в км/ч доступна для системы в виде целочисленного значения.\n" \
    "Какой будет наиболее вероятный набор значений (км/ч)," \
    "выявленных путем применения анализа граничных значений," \
    "где релевантны только граничные значения на границах классов эквивалентности?\n\n" \
    "Варианты ответов:\n" \
    "1) 0, 49, 50, 54, 59, 60.\n" \
    "2) 50, 55, 60.\n" \
    "3) 49, 50, 54, 55, 60, 62.\n" \
    "4) 50, 51, 55, 56, 60, 61."

QUESTION27 = "Вопрос #27\n" \
    "Сотрудникам компании выплачиваются премии, если они работают в компании более года и достигают цели, " \
    "которая была согласована индивидуально ранее. Какие из следующих тестовых сценариев представляют ситуацию, " \
    "которая может произойти в реальной жизни, и отсутствует в таблице альтернатив выше?\n\n" \
    "Варианты ответов:\n" \
    "1) Условие1 = ДА, Условие2 = НЕТ, Условие3 = ДА, Действие= НЕТ.\n" \
    "2) Условие1 = ДА, Условие2 = ДА, Условие3 = НЕТ, Действие= ДА.\n" \
    "3) Условие1 = НЕТ, Условие2 = НЕТ, Условие3 = ДА, Действие= НЕТ.\n" \
    "4) Условие1 = НЕТ, Условие2 = ДА, Условие3 = НЕТ, Действие= НЕТ."

QUESTION28 = "Вопрос #28\n" \
    "Какое из следующих утверждений о представленной ниже диаграмме переходов и таблице тестовых сценариев КОРРЕКТНО?\n\n" \
    "Варианты ответов:\n" \
    "1) Данные тестовые сценарии покрывают действительные и недействительные переходы на диаграмме переходов.\n" \
    "2) Данные тестовые сценарии представляют все возможные действительные переходы на диаграмме переходов.\n" \
    "3) Данные тестовые сценарии представляют некоторые действительные переходы на диаграмме переходов.\n" \
    "4) Данные тестовые сценарии представляют пары переходов на диаграмме переходов."

QUESTION29 = "Вопрос #29\n" \
    "Видео приложение имеет следующее требование: Приложение должно воспроизводить видео со следующим разрешением экрана:\n" \
    "1. 640x480.\n" \
    "2. 1280x720.\n" \
    "3. 1600x1200.\n" \
    "4. 1920x1080.\n" \
    "Какой тестовый сценарий из следующего списка является результатом применения метода эквивалентного " \
    "разбиения для проверки этого требования?\n\n" \
    "Варианты ответов:\n" \
    "1) Проверить, что приложение может воспроизводить видео на экране с разрешением 1920x1080 (1 тестовый сценарий).\n" \
    "2) Проверить, что приложение может воспроизводить видео на экранах с разрешением 640x480 и 1920x1080 (2 тестовых сценария).\n" \
    "3) Проверить, что приложение может воспроизводить видео на экранах со всеми разрешениями из требований (4 тестовых сценария).\n" \
    "4) Проверить, что приложение может воспроизводить видео на экранах хотя бы с одним разрешением из требований (1 тестовый сценарий)."

QUESTION30 = "Вопрос #30\n" \
    "Какое из следующих утверждение ЛУЧШЕ ВСЕГО описывает распределение задач между руководителем тестирования и тестировщиком?\n\n" \
    "Варианты ответов:\n" \
    "1) Руководитель тестирование планирует активности тестирования и выбирает стандарты, " \
    "которым необходимо следовать, а тестировщик выбирает инструменты и определяет рекомендации по их использованию.\n" \
    "2) Руководитель тестирования планирует и контролирует активности тестирования, " \
    "а тестировщик определяет тесты и интегрированную среду автоматизированного тестирования..\n" \
    "3) Руководитель тестирования планирует, отслеживает и контролирует активности тестирования, " \
    "а тестировщик проектирует тесты и принимает решение о выпуске тестируемого объекта.\n" \
    "4) Руководитель тестирования планирует и организует тестирование и определяет тестовые сценарии, " \
    "а тестировщик приоритизирует и выполняет тесты."

QUESTION31 = "Вопрос #31\n" \
    "Какие из следующих метрик НАИБОЛЕЕ полезны для мониторинга выполнения тестов?\n\n" \
    "Варианты ответов:\n" \
    "1) Процент выполненных тестовых сценариев.\n" \
    "2) Среднее число тестировщиков, задействованных при выполнении тестов.\n" \
    "3) Среднее число тестировщиков, задействованных при выполнении тестов.\n" \
    "4) Процент созданных и прошедших рецензирование тестовых сценариев."

QUESTION32 = "Вопрос #32\n" \
    "Какие ДВА пункта из следующих могут влиять и быть частью (исходного) планирования тестов?\n\n" \
    "Варианты ответов:\n" \
    "1) Ограничение бюджета.\n" \
    "2) Цели тестирования.\n" \
    "3) Журнал тестирования.\n" \
    "4) Уровень отказов.\n" \
    "5) Сценарии использования системы.\n" \
    "Выберите ДВА варианта."

QUESTION33 = "Вопрос #33\n" \
    "Какие из следующих наборов содержат только типичные критерии завершения тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Измерения надежности, тестовое покрытие, стоимость тестирования, " \
    "график и статус исправления ошибок и оставшихся рисков.\n" \
    "2) Измерения надежности, тестовое покрытие, уровень независимости тестировщиков и завершенность продукта.\n" \
    "3) Измерения надежности, тестовое покрытие, стоимость тестирования, доступность тестового окружения, " \
    "время вывода продукта на рынок и завершенность продукта.\n" \
    "4) Время вывода продукта на рынок, оставшиеся дефекты, квалификация тестировщиков, " \
    "доступность тестопригодных сценариев использования системы, тестовое покрытие и стоимость тестирования."

QUESTION34 = "Вопрос #34\n" \
    "Что одно из следующего НЕ включается в итоговый отчет о тестировании?\n\n" \
    "Варианты ответов:\n" \
    "1) Определение критериев прохождения/непрохождения и целей тестирования.\n" \
    "2) Отклонения от подхода к тестированию.\n" \
    "3) Измерения текущего прогресса относительно критериев выхода.\n" \
    "4) Оценка качества элемента тестирования."

QUESTION35 = "Вопрос #35\n" \
    "В рамках проекта разрабатывается «умный» термостат нагревателя. " \
    "Алгоритмы управления термостатом были смоделированы с помощью Matlab/Simulink и " \
    "работают на сервере через Интернет. Термостат использует инструкции сервера для запуска нагревательных клапанов.\n" \
    "Руководитель тестирования определил следующую стратегию/ подход в плане тестирования:\n" \
    "1. Приемочное тестирование для всей системы выполняется как тестирование на основе опыта.\n" \
    "2. Алгоритмы управления на сервере тестируются во время реализации приложения с использованием непрерывной интеграции.\n" \
    "3. Функциональное тестирование термостата проводится как тестирование, основанное на рисках.\n" \
    "4. Тестирование безопасности данных/связи через Интернет проводится совместно с внешними экспертами по безопасности.\n" \
    "Какие четыре общих типа стратегий/подходов к тестированию реализовал руководитель тестирования в плане тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Методический, аналитический, реактивный и анти-регрессионный.\n" \
    "2) Аналитический, на основе моделей, консультационный и реактивный.\n" \
    "3) На основе моделей, методический, аналитический и консультативный.\n" \
    "4) Анти-регрессионный, консультативный, реактивный и методический."

QUESTION36 = "Вопрос #36\n" \
    "Что из следующего является характеристикой подхода на основе метрик к оценке тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Бюджет, израсходованный на предыдущий схожий проект.\n" \
    "2) Общий опыт, полученный в собеседовании с руководителями тестирования.\n" \
    "3) Оценки затрат на автоматизацию тестирования, принятую командой тестирования.\n" \
    "4) Средние расчеты, полученные от бизнес-экспертов."

QUESTION37 = "Вопрос #37\n" \
    "Как руководитель тестирования, вы ответственны за тестирование следующих требований:\n" \
    "R1 - Аномалии процесса\n" \
    "R2 - Синхронизация\n" \
    "R3 - Утверждение\n" \
    "R4 - Решение проблем\n" \
    "R5 - Финансовые данные\n" \
    "R6 - Данные диаграмм\n" \
    "R7 - Изменения в профиле пользователя\n" \
    "Обозначение: Логические зависимости требований (A -> B означает, что B зависит от A):\n" \
    "Какой из следующих параметров структурирует график выполнения тестов в соответствии с зависимостями требований?\n\n" \
    "Варианты ответов:\n" \
    "1) R1 -> R3 -> R4 -> R7 -> R2 -> R5 -> R6 .\n" \
    "2) R1 -> R3 -> R2 -> R4 -> R7 -> R5 -> R6.\n" \
    "3) R1 -> R3 -> R2 -> R5 -> R6 -> R4 -> R7.\n" \
    "4) R1 -> R2 -> R5 -> R6 -> R3 -> R4 -> R7."

QUESTION38 = "Вопрос #38\n" \
    "Вы тестируете новую версию программного обеспечения для кофе-машины. \n" \
    "Машина может готовить различные виды кофе на основе четырех категорий: объем чашки, сахар, молоко и сироп. \n" \
    "Критерии следующие:\m\n" \
    "• Объем чашки (маленький, средний, большой),\n" \
    "• Сахар (нет, 1 порция, 2 порция, 3 порция, 4 порция),\n" \
    "• Молоко (да, нет),\n" \
    "• Кофейный сироп (без сиропа, карамель, фундук, ваниль).\n\n" \
    "Теперь вы пишете отчет о дефекте со следующей информацией:\n" \
    "Название: Низкая температура кофе.\n" \
    "Краткое описание: Когда вы выбираете кофе с молоком, время приготовления кофе слишком велико, \n" \
    "а температура напитка слишком низкая (менее 40 °C).\n" \
    "Ожидаемый результат: температура кофе должна быть стандартной (около 75 °C).\n" \
    "Степень риска: Средний\n" \
    "Приоритет: Нормальный\n" \
    "Какая ценная информация была опущена в вышеуказанном отчете о дефекте?\n\n" \
    "Варианты ответов:\n" \
    "1) Фактический результат теста.\n" \
    "2) Данные, идентифицирующие тестируемую кофе-машину.\n" \
    "3) Статус дефекта.\n" \
    "4) Идеи для улучшения тестового сценария."

QUESTION39 = "Вопрос #39\n" \
    "Что из нижеперечисленного МОЖЕТ БЫТЬ преимуществом инструментов выполнения теста?\n\n" \
    "Варианты ответов:\n" \
    "1) Легко создавать регрессионные тесты.\n" \
    "2) Легко поддерживать контроль версий наборов тестов.\n" \
    "3) Легко проектировать тесты безопасности.\n" \
    "4) Легко выполнять регрессионные тесты."

QUESTION40 = "Вопрос #40\n" \
    "Сопоставьте следующие инструменты тестирования (A-D) с их корректным описанием (1-4)\n" \
    "1. Инструментальная поддержка управления тестированием и тестовым окружением.\n" \
    "2. Инструментальная поддержка статического тестирования.\n" \
    "3. Инструментальная поддержка выполнения и протоколирования тестов.\n" \
    "4. Инструментальная поддержка измерения производительности и динамического анализа.\n\n" \
    "А. Инструменты покрытия.\n" \
    "B. Инструменты управления конфигурацией.\n" \
    "C. Инструменты рецензирования.\n" \
    "D. Инструменты мониторинга.\n\n" \
    "Варианты ответов:\n" \
    "1) 1A, 2B, 3D, 4C.\n" \
    "2) 1B, 2C, 3D, 4A.\n" \
    "3) 1A, 2C, 3D, 4B.\n" \
    "4) 1B, 2C, 3A, 4D."