INTRO = "\nВам предстоит ответить на 40 билетов экзамена ISTQB.\n" \
        "Версия билетов ID:B Version 1.1\n" \
        "Как будете готовы приступить к экзамену, отправте любое сообщение."

QUESTION1 = "Вопрос #1\n" \
    "Какой из вариантов наиболее подходит как описание термина «тестовый сценарий»?\n\n" \
    "Варианты ответов:\n" \
    "1) Документ, в котором " \
    "указана последовательность действий теста. Также известен как автоматизи " \
    "рованный сценарий тестирования или ручной сценарий тестирования.\n" \
    "2) Множество входных значений и ожидаемых результатов с выполнением предварительных условий " \
    "и постусловий, разработанное для конкретного тестового состояния. \n" \
    "3) Атрибут системы, определенный с помощью документированныx требований (Например, надежность, " \
    "удобство и простота использования или конструктивные ограничения), который будет использован при выполнении теста.\n" \
    "4) Элемент или событие системы, которое может быть проверено одним или несколькими тестовыми условиями, " \
    "например функция, транзакция, свойство, атрибут качества или структурный элемент. "


QUESTION2 = "Вопрос #2\n" \
    "Какой из вариантов является главной целью тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Предотвращение дефектов.\n" \
    "2) Проверка выполнения плана проекта согласно требованиям.\n" \
    "3) Получение уверенности в команде разработки.\n" \
    "4) Выпуск релиза тестируемой системы"

QUESTION3 = "Вопрос #3\n" \
    "Какой из вариантов является примером отказа системы круиз-контроль автомобиля ?\n\n" \
    "Варианты ответов:\n" \
    "1) Разработчик в системе забыл переименовать переменные после того, " \
    "как произвел операции вырезать и вставить.\n" \
    "2) В систему был включен ненужный код, который подает сигнал тревоги при движении задним ходом. \n" \
    "3) Система перестает поддерживать заданную скорость, " \
    "когда в радиоприемнике увеличивают или уменьшают громкость.\n" \
    "4) В спецификации дизайна системы ошибочно указывается скорость в км / ч."

QUESTION4 = "Вопрос #4\n" \
    "Какой из вариантов является дефектом системы фитнес-трекера?\n\n" \
    "Варианты ответов:\n" \
    "1) Автор технических требований был незнаком с областью фитнес-тренировок, " \
    "поэтому ошибочно предположил, что пользователи хотели измерять сердцебиение в ударах в час.\n" \
    "2) Тестировщик интерфейса смартфона не был обучен тестированию таблицы переходов, поэтому пропустил важный дефект.\n" \
    "3) Неправильная переменная конфигурации, реализованная в функции GPS, " \
    "может вызвать проблемы с получением данных о местоположении в летнее время.\n" \
    "4) Из-за того, что система никогда не работала на переносных устройствах, " \
    "дизайнер пользовательского интерфейса неправильно понял влияние отраженного солнечного света."

QUESTION5 = "Вопрос #5\n" \
    "В результате анализа рисков основное внимание тестирования направляется на те области тестируемой системы, " \
    "в которых первоначальное тестирование обнаружило больше дефектов.\n" \
    "О каком из следующих принципов тестирования говорится выше?\n\n" \
    "Варианты ответов:\n" \
    "1) Парадокс пестицида.\n" \
    "2) Тестирование зависит от контекста.\n" \
    "3) Заблуждение об отсутствии ошибок.\n" \
    "4) Кластеризация дефектов."

QUESTION6 = "Вопрос #6\n" \
    "Соотнесите следующие активности и задачи в тестировании:\n" \
    "А. Проектирование тестов\n" \
    "В. Реализация тестов\n" \
    "C. Выполнение тестов\n" \
    "D. Завершение тестирования\n\n" \
    "1. Ввод запросов на изменение для отчетов об открытых дефектах.\n" \
    "2. Определение тестовых данных для поддержки тестовых сценариев.\n" \
    "3. Приоритезация тестовых процедур и создание тестовых данных.\n" \
    "4. Анализ расхождений для определения их причины.\n" \
    "Какой из вариантов указывает на верное соответствие активностей и задач?\n\n" \
    "Варианты ответов:\n" \
    "1) А-2, В-3, С-4, D-1\n" \
    "2) А-2, В-1, С-3, D-4\n" \
    "3) A-3, B-2, C-4, D-1\n" \
    "4) A-3, B-2, C-1, D-4"

QUESTION7 = "Вопрос #7\n" \
    "Что из следующего ЛУЧШЕ ВСЕГО описывает, как улучшается процесс тестирования за счет обеспечения " \
    "прослеживаемости (трассируемости) между базисом тестирования и тестовыми артефактами?\n\n" \
    "Варианты ответов:\n" \
    "1) Тестирование в период сопровождения может быть полностью автоматизировано на основе " \
    "изменений в первоначальных требованиях.\n" \
    "2) Возможность определить, увеличил ли новый тестовый сценарий покрытие требований.\n" \
    "3) Руководители тестирования могут определить, какие тестировщики обнаружили самые критичные дефекты.\n" \
    "4) Области, на которые могут повлиять побочные эффекты изменений, направляются на подтверждающее тестирование."

QUESTION8 = "Вопрос #8\n" \
    "Какие из следующих качеств БОЛЬШЕ присущи мышлению тестировщика, а не разработчика?\n\n" \
    "Варианты ответов:\n" \
    "1) Опыт на основе собственных усилий.\n" \
    "2) Способность предугадывать, что может пойти не так.\n" \
    "3) Хорошее общение с членами команды.\n" \
    "4) Внимание к деталям."


QUESTION9 = "Вопрос #9\n" \
    "Рассмотрим следующие утверждения о связи активностей тестирования и разработки в " \
    "жизненном цикле программного обеспечения:\n" \
    "1. Для каждой активности разработки существует соответствующая активность тестирования.\n" \
    "2. Рецензирование должно начинаться после того, как станут доступны окончательные версии документов.\n" \
    "3. Проектирование и реализация тестов должны начинаться во время соответствующей деятельности по разработке.\n" \
    "4. Тестирование следует начинать на самых ранних этапах жизненного цикла программного обеспечения.\n" \
    "Какой из следующих вариантов ПРАВИЛЬНО показывает, какие утверждения являются истинными и ложными?\n\n" \
    "Варианты ответов:\n" \
    "1) Истина - 1, 2; Ложь - 3, 4\n" \
    "2) Истина - 2, 3; Ложь - 1, 2\n" \
    "3) Истина - 1, 2, 4; Ложь – 3\n" \
    "4) Истина - 1, 4; Ложь – 2, 3"


QUESTION10 = "Вопрос #10\n" \
    "Пусть выполняемое тестирование имеет следующие особенности:\n" \
    "● выполняется на основе спецификаций интерфейса;\n" \
    "● сосредоточено на поиске сбоев в коммуникации;\n" \
    "● подход к тестированию использует как функциональные, так и структурные типы тестов.\n" \
    "Какой из следующих уровней тестирования выполняется ВЕРОЯТНЕЕ ВСЕГО?\n\n" \
    "Варианты ответов:\n" \
    "1) Тестирование интеграции компонентов.\n" \
    "2) Приемочное тестирование.\n" \
    "3) Системное тестирование.\n" \
    "4) Компонентное тестирование."

QUESTION11 = "Вопрос #11\n" \
    "Какое из следующих утверждений о видах и уровнях тестирования является правильным?\n\n" \
    "Варианты ответов:\n" \
    "1) Функциональные и нефункциональные тесты могут быть выполнены на системном и приемочном уровнях тестирования, " \
    "в то время как тестирование белого ящика ограничивается уровнями компонентного и интеграционного тестирования.\n" \
    "2) Функциональное тестирование может быть выполнено на любом уровне тестирования, " \
    "в то время как тестирование белого ящика будет ограничено уровнем компонентного тестирования.\n" \
    "3) Допустимо выполнение функционального и нефункционального тестирования и " \
    "тестирования белого ящика на любом уровне тестирования.\n" \
    "4) Функциональное и нефункциональное тестирование может быть выполнено на любом уровне тестирования, " \
    "в то время как тестирование белого ящика будет ограничено уровнем компонентного тестирования и " \
    "уровнем тестирования интеграции компонентов."

QUESTION12 = "Вопрос #12\n" \
    "Какое из следующих утверждений ЛУЧШЕ ВСЕГО сравнивает цели подтверждающего " \
    "тестирования и регрессионного тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Целью регрессионного тестирования является проверка того, что все ранее выполненные тесты " \
    "по-прежнему работают правильно, в то время как цель подтверждающего тестирования — убедиться, " \
    "чтобы любые исправления, сделанные в одной части системы не влияли отрицательно на другие части системы.\n " \
    "2) Цель подтверждающего тестирования — проверить, что ранее обнаруженный дефект был исправлен, " \
    "в то время как цель регрессионного тестирования - убедиться, что исправление в одной части системы " \
    "не повлияло негативно на никакие другие части системы.\n" \
    "3) Цель регрессионного тестирования — убедиться, что любые изменения в одной части системы не привели " \
    "к отказу в другой части, в то время как целью подтверждающего тестирования является проверка того, " \
    "что все ранее выполненные тесты по-прежнему дают те же результаты, что и раньше.\n" \
    "4) Цель подтверждающего тестирования — подтверждение, что изменения в системе были сделаны успешно, " \
    "в то время как цель регрессионного тестирования — запуск тестов, которые ранее обнаруживали дефекты, " \
    "чтобы убедиться, что они в настоящее время работают правильно."

QUESTION13 = "Вопрос #13\n" \
    "Какое из следующих утверждений ПРАВИЛЬНО описывает роль анализа влияния при тестировании в период сопровождения?\n\n" \
    "Варианты ответов:\n" \
    "1) Анализ влияния будет использоваться при принятии решения о добавлении исправления в поддерживаемую систему.\n" \
    "2) Анализ влияния будет использоваться, чтобы определить, как данные должны быть " \
    "перенесены в поддерживаемую систему.\n" \
    "3) Анализ влияния будет использоваться, чтобы решить, какие срочные исправления являются наиболее " \
    "важными для пользователей.\n" \
    "4) Анализ влияния будет использоваться для определения эффективности новых тестовых сценариев при тестировании в " \
    "период сопровождения."

QUESTION14 = "Вопрос #14\n" \
    "Какое из следующих утверждений ПРАВИЛЬНО отражает преимущества методов статического тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Введя рецензирования, мы обнаружили, что увеличилось как качество спецификаций, " \
    "так и время разработки и тестирования.\n" \
    "2) С помощью статического тестирования мы повысили эффективность и снизили стоимость управления дефектами, " \
    "так как легче исправить дефекты на более поздних этапах жизненного цикла.\n" \
    "3) Теперь, когда мы требуем использования статического анализа, количество пропущенных требований уменьшилось, " \
    "а взаимодействие между тестировщиками и разработчиками улучшилось.\n" \
    "4) С использованием методов статического анализа мы начали находить дефекты в коде, " \
    "которые могли бы не быть найдены путем выполнения только динамического тестирования."

QUESTION15 = "Вопрос #15\n" \
    "Какая из следующих последовательностей ЛУЧШЕ показывает основные мероприятия по процессу " \
    "рецензирования рабочего продукта?\n\n" \
    "Варианты ответов:\n" \
    "1) Инициирование рецензирования - Выбор рецензента – Индивидуальное рецензирование – " \
    "Коммуникации по вопросам и анализ – Отчетность\n" \
    "2) Планирование и подготовка - Обзорная встреча - Индивидуальное рецензирование - " \
    "Внесение изменений - Отчетность\n" \
    "3) Подготовка – Обнаружение проблем – Коммуникации по вопросам и анализ - " \
    "Внесение изменений - Отчетность\n" \
    "4) Планирование - Инициирование рецензирования – Индивидуальное рецензирование– " \
    "Коммуникации по вопросам и анализ – Внесение изменений и отчетность"

QUESTION16 = "Вопрос #16\n" \
    "В каком из следующих вариантов роли и обязанности в формальном рецензировании соответствуют ПРАВИЛЬНО?\n\n" \
    "Варианты ответов:\n" \
    "1) Менеджер - Принимает решение о проведении рецензирования\n" \
    "2) Руководитель рецензирования - Обеспечивает эффективное проведение рецензирования на совещаниях.\n" \
    "3) Секретарь - Исправляет дефекты в рассматриваемом продукте\n" \
    "4) Модератор - контролирует текущую рентабельность."

QUESTION17 = "Вопрос #17\n" \
    "В вашей организации используется рецензирование со следующими атрибутами:\n" \
    "● Присутствует роль секретаря\n" \
    "● Целью является обнаружение возможных дефектов\n" \
    "● Обзорное совещание проводится автором\n" \
    "● Рецензенты находят потенциальные дефекты путем индивидуального рецензирования\n" \
    "● Создается отчет о рецензировании\n" \
    "Какой из следующих типов рецензирования наиболее вероятно использовался?\n\n" \
    "Варианты ответов:\n" \
    "1) Неформальное рецензирование\n" \
    "2) Пошаговый разбор\n" \
    "3) Техническое рецензирование\n" \
    "4) Инспекция"

QUESTION18 = "Вопрос #18\n" \
    "Вас попросили принять участие в рецензировании на основе чек-листов следующего " \
    "отрывка спецификации требований библиотечной системы:\n\n" \
    "Библиотекари могут:\n" \
    "1. Регистрировать новых читателей.\n" \
    "2. Принимать книги от читателей.\n" \
    "3. Принимать штрафы от читателей.\n" \
    "4. Добавлять новые книги в систему с их ISBN, автором и названием.\n" \
    "5. Удалять книги из системы.\n" \
    "6. Получать ответы от системы в течение 5 секунд.\n\n" \
    "Читатели могут:\n" \
    "7. Взять максимум три книги за один раз.\n" \
    "8. Просматривать историю взятия/бронирования книг.\n" \
    "9. Быть оштрафованными при невозврате книги в течение 3-х недель.\n" \
    "10. Получать ответы от системы в течение 3-х секунд.\n" \
    "11. Взять книгу бесплатно максимум на 4-е недели.\n" \
    "12. Бронировать книги (если они уже взяты).\n\n" \
    "Все пользователи (библиотекари и читатели):\n" \
    "13. Могут искать книги по ISBN, автору или названию.\n" \
    "14. Могут просматривать системный каталог.\n" \
    "15. Система должна реагировать на пользовательские запросы в течение 3-х секунд.\n" \
    "16. Пользовательский интерфейс должен быть простым в использовании.\n\n" \
    "Вам было поручено на основе чек-листов проверить в спецификации несогласованности между " \
    "отдельными требованиями (то есть конфликты между требованиями).\n" \
    "Какой из следующих вариантов ПРАВИЛЬНО выявляет несоответствия между парами требований?\n\n" \
    "Варианты ответов:\n" \
    "1) 6–10, 6–15, 7–12\n" \
    "2) 6–15, 9–11\n" \
    "3) 6–10, 6–15, 9–1\n" \
    "4) 6–15, 7–12"

QUESTION19 = "Вопрос #19\n" \
    "Какой из следующих вариантов обеспечивает ЛУЧШЕЕ описание исследовательского тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Практика тестирования, в которой используется углубленное исследование предыстории тестового " \
    "объекта для выявления потенциально слабых мест, которые исследуются с помощью тестовых сценариев.\n" \
    "2) Подход к тестированию, при котором тестировщики активно проектируют и выполняют тесты, " \
    "основанные на их знаниях, исследовании объекта тестирования и на результатах предыдущих тестов.\n" \
    "3) Подход к разработке тестов, при котором действия по тестированию планируются как непрерывные " \
    "сеансы анализа и разработки тестов, часто используемые в сочетании с тестированием на основе чек-листов.\n" \
    "4) Тестирование на основе опыта, знаний и интуиции тестировщика."

QUESTION20 = "Вопрос #20\n" \
    "Какой из следующих вариантов ЛУЧШЕ ВСЕГО демонстрирует соответствия методов и видов тестирования?\n" \
    "1. Покрытие измеряется на основе выбранной структуры в объекте тестирования.\n" \
    "2. Будут проверяться внутренние процессы тестируемого объекта.\n" \
    "3. Проверки будут основаны на вероятности дефектов и их распределении.\n" \
    "4. Проверяются отклонения относительно требований.\n" \
    "5. Пользовательские истории будут использованы в качестве базиса тестирования.\n" \
    "Черный - методы тестирования черного ящика\n" \
    "Белый - методы тестирования белого ящика\n" \
    "Опыт - методы тестирования, основанные на опыте\n\n" \
    "Варианты ответов:\n" \
    "1) Черный - 4, 5 Белый - 1, 2 Опыт - 3\n" \
    "2) Черный - 3 Белый - 1, 2 Опыт - 4, 5\n" \
    "3) Черный - 4 Белый - 1, 2 Опыт - 3, 5\n" \
    "4) Черный - 1, 3, 5 Белый - 2 Опыт – 4"

QUESTION21 = "Вопрос #21\n" \
    "Фитнес-приложение измеряет количество шагов, которые пользователи проходят ежедневно, " \
    "и обеспечивает обратную связь, чтобы побуждать пользователя держать себя в форме.\n" \
    "Обратная связь для различного количества шагов должна быть такая:\n" \
    "До 1000 - Лежебока!\n" \
    "От 1000 до 2000 - Лентяй!\n" \
    "От 2000 до 4000 – Можешь лучше!\n" \
    "От 4000 до 6000 -Неплохо!\n" \
    "От 6000 – Так держать!\n" \
    "Какой из следующих наборов из тестовых входных данных обеспечит максимальное покрытие эквивалентного разбиения?\n\n" \
    "Варианты ответов:\n" \
    "1) 0, 1000, 2000, 3000, 4000\n" \
    "2) 1000, 2001, 4000, 4001, 6000\n" \
    "3) 123, 2345, 3456, 4567, 5678\n" \
    "4) 666, 999, 2222, 5555, 6666"

QUESTION22 = "Вопрос #22\n" \
    "Для растений производится ежедневная фиксация степени солнечного излучения, " \
    "основанная на комбинации продолжительности, которому растения подвергаются под воздействием " \
    "солнца (ниже 3 часов, от 3 до 6 часов или выше 6 часов) и средней интенсивности " \
    "солнечного излучения (очень низкой, низкой, средней, высокой).\n" \
    "Заданы следующие тестовые сценарии: (см. таблицу на изображении)\n" \
    "Какое минимальное количество дополнительных тестовых сценариев является необходимым " \
    "для обеспечения полного покрытия всех допустимых входных данных методом эквивалентного разбиения?\n\n" \
    "Варианты ответов:\n" \
    "a) 1\n" \
    "b) 2\n" \
    "c) 3\n" \
    "d) 4"

QUESTION23 = "Вопрос #23\n" \
    "Приложение Умный дом измеряет среднюю температуру в доме в течение предыдущей недели и предоставляет жильцам данные об экологичности, основанные на этой температуре.\n" \
    "Обратная связь для различных средних температурных диапазонов (с точностью до градуса Цельсия) должна быть:\n" \
    "До 10°C - Очень холодно!\n" \
    "От 11°C до 15°C - Прохладно!\n" \
    "От 16°C до 19°C - Нормально!\n" \
    "От 20°C до 22°C - Слишком тепло!\n" \
    "Выше 22°C - Жарко!\n" \
    "Какой из следующих наборов тестовых входных данных обеспечивает самый высокий уровень покрытия " \
    "границ при использовании двухточечного анализа граничных значений?\n\n" \
    "Варианты ответов:\n" \
    "a) 0 °C, 11 °С, 20 °С, 22 °С, 23 °С\n" \
    "b) 9 °С, 15 °С,19 °С, 23 °С, 100 °С\n" \
    "c) 10 °С, 16 °С, 19 °С, 22 °С, 23 °С\n" \
    "d) 14 °С, 15 °С, 18 °С, 19 °С, 21 °С, 22 °С"

QUESTION24 = "Вопрос #24\n" \
    "Тестирование таблицы решений в настоящее время осуществляется для системы штрафов " \
    "за превышение скорости. Два тестовых сценария, которые уже были сгенерированы " \
    "для правил R1 и R4, показаны на рисунке, верхняя таблица\n" \
    "Заданы следующие дополнительные тестовые сценарии, показаны на рисунке, нижняя таблица.\n" \
    "Какие два из дополнительных тестовых сценариев будут обеспечивать полное покрытие та " \
    "блицы решений (при сочетании с тестовыми сценариями, которые уже были сгенерированы для правил R1 и R4)?\n\n" \ 
    "Варианты ответов:\n" \
    "1) DT1, DT2\n" \
    "2) DT2, DT3\n" \
    "3) DT2, DT4\n" \
    "4) DT3, DT4"

QUESTION25 = "Вопрос #25\n" \
    "Учитывая следующие состояния модели батареи зарядного устройства программного обеспечения: см. рисунок\n" \
    "Какая из следующих последовательностей по таблице переходов обеспечивает самый высокий уровень " \
    "покрытия переходов для этой модели?\n\n" \
    "Варианты ответов:\n" \
    "1) ВЫКЛЮЧЕНО → ОЖИДАНИЕ → ВЫКЛЮЧЕНО → ОЖИДАНИЕ → ЗАРЯЖЕНО → ПОДЗАРЯДКА → МАКСИМУМ → ПОДЗАРЯДКА → МИНИМУМ\n" \
    "2) ОЖИДАНИЕ → ЗАРЯЖЕНО → ОЖИДАНИЕ → ВЫКЛЮЧЕНО → ОЖИДАНИЕ → ЗАРЯЖЕНО → ПОДЗАРЯДКА → МИНИМУМ → ЗАРЯЖАТЬ\n" \
    "3) МАКСИМУМ → ПОДЗАРЯДКА → МИНИМУМ → ПОДЗАРЯДКА → ЗАРЯЖЕНО → ОЖИДАНИЕ → ЗАРЯЖЕНО → ОЖИДАНИЕ → ЗАРЯЖЕНО\n" \
    "4) ОЖИДАНИЕ → ЗАРЯЖЕНО → ПОДЗАРЯДКА → МАКСИМУМ → ПОДЗАРЯДКА → ЗАРЯЖЕНО → ОЖИДАНИЕ → ВЫКЛЮЧЕНО → ОЖИДАНИЕ"

QUESTION26 = "Вопрос #26\n" \
    "Какое из следующих утверждений ЛУЧШЕ ВСЕГО описывает, " \
    "как тестовые сценарии создаются на основе сценариев использования?\n\n" \
    "Варианты ответов:\n" \
    "1) Тестовые сценарии создаются для выполнения определенных базовых,исключительных и ошибочных действий, " \
    "выполняемых тестируемой системой в сотрудничестве с участниками.\n" \
    "2) Тестовые сценарии получены путем определения компонентов, включенных в сценарии использования и " \
    "создания интеграционных тестов, которые реализуют взаимодействие этих компонентов.\n" \
    "3) Тестовые сценарии создаются путем анализа взаимодействия участников с системой, " \
    "чтобы обеспечить простоту использования пользовательских интерфейсов.\n" \
    "4) Тестовые сценарии создаются для выполнения каждой из точек принятия решений в потоках бизнес-процессов " \
    "сценариев использования, чтобы обеспечить 100% покрытие альтернатив этих потоков."

QUESTION27 = "Вопрос #27\n" \
    "Какое из следующих описаний покрытия операторов является ПРАВИЛЬНЫМ?\n\n" \
    "Варианты ответов:\n" \
    "1) Покрытие операторов измеряется количеством строк в исходном коде (без учета комментариев), " \
    "использованных при тестировании.\n" \
    "2) Покрытием операторов является доля исполняемых операторов в исходном коде, использованная при тестировании.\n" \
    "3) Покрытием операторов является процент количества строк исходного кода, использованных при тестировании.\n" \
    "4) Покрытие операторов измеряется количеством исполняемых операторов исходного кода, " \
    "использованных при тестировании."

QUESTION28 = "Вопрос #28\n" \
    "Какое из следующих описаний покрытия альтернатив является ПРАВИЛЬНЫМ?\n\n" \
    "Варианты ответов:\n" \
    "1) Покрытие альтернатив является процентом возможных путей в исходном коде, использованных при тестировании.\n" \
    "2) Покрытие альтернатив является процентом бизнес потоков, затрагивающих компонент, использованных при тестировании.\n" \
    "3) Покрытие альтернатив измеряется числом операторов «если» в коде, использованных при тестировании с вариантами истинных и ложных результатов.\n" \
    "4) Покрытие альтернатив это доля результатов альтернатив в исходном коде, использованных при тестировании."

QUESTION29 = "Вопрос #29\n" \
    "Какой из следующих вариантов ЛУЧШЕ ВСЕГО описывает концепцию предположения об ошибках?\n\n" \
    "Варианты ответов:\n" \
    "1) Предположение об ошибках требует от вас представить себя на месте пользователя объекта тестирования и " \
    "предугадать ошибки, которые пользователь может сделать, взаимодействуя с ним.\n" \
    "2) Предположение об ошибках включает использование личного опыта в разработке и предугадывание ошибок, " \
    "которые вы сделали бы как разработчик.\n" \
    "3) Предположение об ошибках предполагает использование ваших знаний и опыта в дефектах, обнаруженных в прошлом, " \
    "и типичных ошибок, сделанных разработчиком.\n" \
    "4) Предположение об ошибках требует от вас быстрого дублирования задачи на разработку, " \
    "чтобы определить, какие ошибки может совершить разработчик."

QUESTION30 = "Вопрос #30\n" \
    "Какой из следующих вариантов ЛУЧШЕ ВСЕГО объясняет пользу независимого тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Использование независимой группы тестирования позволяет руководителю проекта переложить ответственность " \
    "за качество конечной поставки на команду тестирования, так чтобы все знали, что качество является " \
    "ответственностью команды тестирования.\n" \
    "2) Если может быть предоставлена команда тестирования, внешняя по отношению к организации, " \
    "у нее появляются определенные преимущества с точки зрения того, что эта команда не так легко поддается " \
    "влиянию проблем управления проектами и необходимости соблюдения строгих сроков поставки.\n" \
    "3) Независимая команда тестирования может работать полностью отдельно от разработчиков, " \
    "ее не нужно отвлекать изменяющимися требованиями проекта, а также она может ограничить общение с " \
    "разработчиками отправлением отчетности через систему управления дефектами.\n" \
    "4) Когда требования являются неоднозначными и неполными, могут быть сделаны допущения в части их интерпретации, " \
    "и независимый тестировщик может быть полезным для проверки допущений и интерпретации, сделанных разработчиком."

QUESTION31 = "Вопрос #31\n" \
    "Какая из следующих задач является самой НАИБОЛЕЕ ВЕРОЯТНОЙ для руководителя тестирования?\n\n" \
    "Варианты ответов:\n" \
    "1) Подготовка итоговых отчетов по тестированию, основанных на информации, собранной в ходе тестирования.\n" \
    "2) Рецензирование тестов, разработанных другими.\n" \
    "3) Создание подробного расписания выполнения тестов.\n" \
    "4) Анализ, рецензирование и оценка требований, спецификаций и моделей на предмет тестируемости."

QUESTION32 = "Вопрос #32\n" \
    "Заданы следующие примеры критериев входа и выхода:\n" \
    "1. Первоначальный бюджет на тестирование в размере $ 30 000 плюс бюджет на непредвиденные расходы в размере $ 7000 уже потрачены.\n" \
    "2. 96% запланированных тестов для графического пакета были выполнены, а остальные тесты являются в настоящее время вне рамок проекта.\n" \
    "3. Тестовое окружение производительности торговой системы была разработана, настроена и проверена.\n" \
    "4. Текущее состояние - отсутствие незакрытых критических дефектов и два высокоприоритетных дефекта.\n" \
    "5. Спецификации автопилота были уже рассмотрены и переработаны.\n" \
    "6. Модуль расчета налоговой ставки прошел компонентное тестирование.\n" \
    "Какой из следующих вариантов ЛУЧШЕ ВСЕГО классифицирует критерии входа и выхода:\n\n" \
    "Варианты ответов:\n" \
    "1) Критерии входа - 5, 6 Критерии выхода - 1, 2, 3, 4\n" \
    "2) Критерии входа - 2, 3, 6 Критерии выхода - 1, 4, 5\n" \
    "3) Критерии входа - 1, 3 Критерии выхода - 2, 4, 5, 6\n" \
    "4) Критерии входа - 3, 5, 6 Критерии выхода - 1, 2, 4"
#img
QUESTION33 = "Вопрос #33\n" \
    "Учитывая следующие приоритеты и зависимости для этих тестовых сценариев: (см. картинку)" \
    "Какое из следующих расписаний выполнения тестов ЛУЧШЕ ВСЕГО рассматривает приоритеты, " \
    "а также техническую и логическую зависимость?\n\n" \
    "Варианты ответов:\n" \
    "1) TC1 - TC3 - TC4 - TC6 - TC2 - TC5\n" \
    "2) TC4 - TC3 - TC1 - TC2 - TC5 - TC6\n" \
    "3) TC4 - TC1 - TC3 - TC5 - TC6 - TC2\n" \
    "4) TC4 - TC2 - TC5 - TC1 - TC3 - TC6"

QUESTION34 = "Вопрос #34\n" \
    "Какое из следующих утверждений о подходах к оценке затрат на тестирование является правильным?\n\n" \
    "Варианты ответов:\n" \
    "1) В методе, основанном на метриках, оценка будет основана на проектных измерениях, " \
    "и такая оценка доступна только после начала тестирования.\n" \
    "2) В методе экспертной оценки группа опытных пользователей, выбранных клиентом, рекомендует бюджет, " \
    "необходимый для тестирования.\n" \
    "3) В методе экспертной оценки руководители тестирования, ответственные за различные активности тестирования, " \
    "прогнозируют ожидаемые трудозатраты на тестирование.\n" \
    "4) В методе, основанном на метриках, среднее значение расходов на тестирование, " \
    "зарегистрированных для некоторых уже выполненных проектов, используется в качестве бюджета на тестирование."

QUESTION35 = "Вопрос #35\n" \
    "Какой из следующих вариантов ЛУЧШЕ ВСЕГО определяет уровень риска?\n\n" \
    "Варианты ответов:\n" \
    "1) Уровень риска рассчитывается путем сложения вероятностей всех проблемных ситуаций и " \
    "финансового ущерба в результате их наступления.\n" \
    "2) Уровень риска оценивается путем перемножения вероятности появления угрозы для системы на шанс, " \
    "что угроза произойдет и приведет к финансовому ущербу.\n" \
    "3) Уровень риска определяется путем сочетания вероятности появления нежелательного события и " \
    "ожидаемого воздействия этого события.\n" \
    "4) Уровень риска является суммой всех потенциальных опасностей в системе, " \
    "умноженной на на сумму всех потенциальных убытков в этой системы."

QUESTION36 = "Вопрос #36\n" \
    "Какой из следующих вариантов БОЛЬШЕ ВСЕГО подходит, чтобы быть примером риска ПРОДУКТА?\n\n" \
    "Варианты ответов:\n" \
    "1) Функции безопасности могут не поддерживаться архитектурой системы.\n" \
    "2) Разработчики могут не иметь времени для исправления всех дефектов, обнаруженных с помощью команды тестирования.\n" \
    "3) Тестовые сценарии могут не обеспечить полное покрытие указанных требований.\n" \
    "4) Тестовое окружение производительности может не быть готовой, прежде чем система будет готова к поставке."

QUESTION37 = "Вопрос #37\n" \
    "Какой из следующих вариантов НАИМЕНЕЕ вероятно будет примером анализа риска продукта, " \
    "ПРАВИЛЬНО влияющего на тестирование?\n\n" \
    "Варианты ответов:\n" \
    "1) Потенциальное влияние недостатков безопасности уже было определено как особенно высокое, " \
    "поэтому тестирование безопасности было приоритетнее некоторых других активностей тестирования.\n" \
    "2) Тестирование определило качество сетевого модуля выше, чем ожидалось, " \
    "поэтому дополнительное тестирование теперь будет проводиться в этой области.\n" \
    "3) У пользователей были проблемы с пользовательским интерфейсом в предыдущей системе, " \
    "поэтому запланировано дополнительное тестирование удобства использования.\n" \
    "4) Время, требующееся для загрузки веб-страниц, является решающим для успеха нового веб-сайта, " \
    "поэтому эксперт по тестированию производительности был принят на работу для этого проекта."

QUESTION38 = "Вопрос #38\n" \
    "Вы выполняете системное тестирование системы продажи железнодорожных билетов и обнаружили " \
    "на основе выполненных вами тестовых сценариев, что иногда система сообщает об отсутствии доступных поездов, " \
    "хотя вы полагаете, что они должны быть. Вы предоставили менеджеру разработки краткое описание " \
    "дефекта и версию системы, на которой проводилось тестирование. Разработчики признают срочность дефекта и " \
    "в настоящее время ждут от Вас предоставления более подробной информации таким образом, " \
    "чтобы они могли исправить этот дефект.\n" \
    "Задана следующая информация:\n" \
    "1. Степень воздействия (критичность) на систему этого дефекта.\n" \
    "2. Идентификация элемента тестирования.\n" \
    "3. Подробная информация о тестовом окружении\n" \
    "4. Срочность / приоритет исправления.\n" \
    "5. Фактические результаты.\n" \
    "6. Ссылка на спецификацию тестового сценария.\n" \
    "Помимо описания дефекта, который включает в себя дамп базы данных и скриншоты, " \
    "какие из частей информации будет БОЛЕЕ полезно включить в первоначальный отчет о дефекте?\n\n" \
    "Варианты ответов:\n" \
    "1) 1, 2, 6\n" \
    "1) 1, 4, 5, 6\n" \
    "2) 2, 3, 4, 5\n" \
    "3) 3, 5, 6"

QUESTION39 = "Вопрос #39\n" \
    "Имеются следующие активности тестирования и тестовые инструменты:\n" \
    "1. Измерение производительности и динамический анализ.\n" \
    "2. Выполнение теста и протоколирование.\n" \
    "3. Управление тестированием и тестовым ПО.\n" \
    "4. Проектирование тестов.\n" \
    "A. Инструменты покрытия требований.\n" \
    "B. Инструменты динамического анализа.\n" \
    "C. Инструменты подготовки тестовых данных.\n" \
    "D. Инструменты управления дефектами.\n" \
    "Какой из следующих вариантов ЛУЧШЕ ВСЕГО показывает соответствия между " \
    "активностями тестирования и тестовыми инструментами?\n\n" \
    "Варианты ответов:\n" \
    "1) 1 - B, 2 - C, 3 - D, 4 – А\n" \
    "2) 1 - B, 2 - А, 3 - C, 4 – D\n" \
    "3) 1 - B, 2 - А, 3 - D, 4 – C\n" \
    "4) 1 - А, 2 - B, 3 - D, 4 - C"

QUESTION40 = "Вопрос #40\n" \
    "Что из перечисленного ВЕРОЯТНЕЕ ВСЕГО будет использоваться в качестве довода " \
    "выполнения пилотного проекта по внедрению инструмента в организацию?.\n\n" \
    "Варианты ответов:\n" \
    "1) Необходимость оценить, как инструмент соответствует существующим процессам и " \
    "практикам применения и определить, что будет необходимо изменить.\n" \
    "2) Необходимость оценить навыки автоматизации тестирования, потребности в обучении, " \
    "наставничестве и коучинге тестировщиков, которые будут использовать инструмент.\n" \
    "3) Необходимость оценить, обеспечивает ли инструмент требуемую функциональность и не " \
    "дублирует ли существующие инструменты тестирования.\n" \
    "4) Необходимость оценить поставщика инструмента в плане обучения и обеспечения другой поддержки."