INTRO = "здравствуйте!\nВам предстоит ответить на 20 билетов экзамена ISTQB.\n" \
        "Как будете готовы приступить к экзамену, отправте любое сообщение."

QUESTION1 = "Вопрос #1\n" \
    "Какой из следующих ответов описывает тестовое условие?\n" \
    "Варианты ответов:\n" \
    "1) Атрибут компонента или системы, описанный или подразумеваемый в спецификации требований.\n" \
    "2) Часть базиса тестирования, имеющая отношение к достижению конкретной цели тестирования.\n" \
    "3) Степень, в которой программный продукт обеспечивает функции, которые удовлетворяют заявленным и подразумеваемым потребностям во время использования программного обеспечения в определенных условиях.\n" \
    "4) Процент всех отдельных исходов условий, которые независимо  влияют на результат альтернативы, проверенной набором тестов."

QUESTION2 = "Вопрос #2\n" \
    "Какое из следующих утверждений является корректной целью тестирования?\n" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION3 = "Вопрос #3\n" \
    "Какое из следующих утверждений корректно описывает разницу между тестированием и отладкой?\n" \
    "Варианты ответов:\n" \
    "1) Тестирование определяет причину дефектов; отладка анализирует дефекты и предлагает меры по их предотвращению.\n" \
    "2) Динамическое тестирование показывает отказы, вызванные дефектами; отладка находит, анализирует и устраняет причины отказов ПО.\n" \
    "3) Тестирование устраняет дефекты; отладка определяет причины отказов.\n" \
    "4) Динамическое тестирование предотвращает причины отказов; отладка устраняет отказы."

QUESTION4 = "Вопрос #4\n" \
    "Какое из следующих утверждений описывает наиболее частую ситуацию при обнаружении отказа во время тестирования или в процессе эксплуатации?" \
    "Варианты ответов:\n" \
    "1) В продукте возникает сбой/отказ, когда пользователь выбирает опцию в диалоговом окне.\n" \
    "2) В сборку была включена неверная версия скомпилированного исходного кода.\n" \
    "3) В алгоритме вычислений использованы неверные входные переменные.\n" \
    "4) Разработчик неверно понял требования к алгоритму."

QUESTION5 = "Вопрос #5\n" \
    "Тестировщик тестирует приложения на мобильных устройствах в течение 5 лет. Он имеет" \
    "большой опыт тестирования мобильных приложений и достигает лучших результатов быстрее," \
    "чем другие. В течение нескольких месяцев этот тестировщик не изменял существующие" \
    "автоматизированные тестовые сценарии и не создавал новые. Это приводит к уменьшению" \
    "количества обнаруживаемых дефектов при выполнении тестов. Какой принцип тестирования не" \
    "соблюдает этот тестировщик?\n" \
    "Варианты ответов:\n" \
    "1) Тестирование зависит от окружения.\n" \
    "2) Исчерпывающее тестирование невозможно.\n" \
    "3) Повторение тестов не вскроет новые дефекты.\n" \
    "4) Дефекты «кластеризуются»."

QUESTION6 = "Вопрос #6\n" \
    "В каком смысле тестирование является частью обеспечения качества?\n" \
    "Варианты ответов:\n" \
    "1) Тестирование проверяет, что требования достаточно детализированы.\n" \
    "2) Тестирование способствует достижению качества различными способами.\n" \
    "3) Тестирование проверяет, что стандарты организации соблюдаются.\n" \
    "4) Тестирование измеряет качество ПО количеством выполненных тестовых сценариев."

QUESTION7 = "Вопрос #7\n" \
    "Какая из следующих активностей является частью «анализа тестирования» в процессе тестирования?\n" \
    "Варианты ответов:\n" \
    "1) Идентификация всей необходимой инфраструктуры и инструментов.\n" \
    "2) Создание наборов тестов из автоматизированных тестовых сценариев.\n" \
    "3) Анализ полученных знаний для улучшения процесса.\n" \
    "4) Оценка базиса тестирования на тестируемость."

QUESTION8 = "Вопрос #8\n" \
    "Сопоставьте следующие рабочие продукты тестирования (1-4) с их корректным описанием (A-D)" \
    "1. Набор тестов" \
    "2. Тестовый сценарий" \
    "3. Автоматизированный тестовый сценарий" \
    "4. Концепция тестирования" \
    "A. Комплект автоматизированных тестовых сценариев с последовательностью инструкций" \
    "B. Набор инструкций для выполнения теста" \
    "C. Содержит ожидаемые результаты" \
    "D. Изложение целей тестирования и, возможно, идей относительно процесса тестирования\n" \
    "Варианты ответов:\n" \
    "1) 1A, 2C, 3B, 4D.\n" \
    "2) 1D, 2B, 3A, 4C.\n" \
    "3) 1A, 2C, 3D, 4B.\n" \
    "4) 1D, 2C, 3B, 4A."

QUESTION9 = "Вопрос #9\n" \
    "Как тестирование белого ящика может быть применено в приемочном тестировании?\n" \
    "Варианты ответов:\n" \
    "1)  Для проверки возможности передачи больших объемов данных между интегрируемыми системами.\n" \
    "2) Для проверки того, были ли выполнены все выражения и альтернативы в коде.\n" \
    "3) Для проверки того, что все ветки процесса были покрыты.\n" \
    "4) Для покрытия всей навигации на веб-странице."

QUESTION10 = "Вопрос #10\n" \
    "Какое из следующих сравнений компонентного и системного тестирования КОРРЕКТНО?\n" \
    "Варианты ответов:\n" \
    "1) Компонентное тестирование проверяет функциональность программных" \
    "модулей, программных объектов и классов, которые могут тестироваться" \
    "отдельно, тогда как системное тестирование проверяет интерфейсы между" \
    "компонентами и взаимодействие между различными частями системы.\n" \
    "2) Тестовые сценарии для компонентного тестирования обычно получают из" \
    "спецификаций компонентов, проектных спецификаций или моделей данных," \
    "тогда как тестовые сценарии для системного тестирования обычно получают из" \
    "спецификаций требований или сценариев использования системы.\n" \
    "3) Компонентное тестирование фокусируется только на функциональных" \
    "характеристиках, тогда как системное тестирование фокусируется на" \
    "функциональных и нефункциональных характеристиках.\n" \
    "4) Компонентное тестирование является обязанностью тестировщиков, тогда как" \
    "системное тестирование обычно является обязанностью пользователей системы."