INTRO = "здравствуйте!\nВам предстоит ответить на 20 билетов экзамена ISTQB.\n" \
        "Как будете готовы приступить к экзамену, отправте любое сообщение."

QUESTION1 = "Вопрос #1\n" \
    "Какой из следующих ответов описывает тестовое условие?\n" \
    "Варианты ответов:\n" \
    "1) Атрибут компонента или системы, описанный или подразумеваемый в спецификации требований.\n" \
    "2) Часть базиса тестирования, имеющая отношение к достижению конкретной цели тестирования.\n" \
    "3) Степень, в которой программный продукт обеспечивает функции, которые удовлетворяют заявленным и подразумеваемым потребностям во время использования программного обеспечения в определенных условиях.\n" \
    "4) Процент всех отдельных исходов условий, которые независимо  влияют на результат альтернативы, проверенной набором тестов."

QUESTION2 = "Вопрос #2\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION3 = "Вопрос #3\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION4 = "Вопрос #4\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION5 = "Вопрос #5\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION6 = "Вопрос #6\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION7 = "Вопрос #7\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION8 = "Вопрос #8\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION9 = "Вопрос #9\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."

QUESTION10 = "Вопрос #10\n" \
    "Какое из следующих утверждений является корректной целью тестирования?" \
    "Варианты ответов:\n" \
    "1) Тестирование должно начинаться как можно позже, чтобы у разработки было достаточно времени на создание хорошего продукта.\n" \
    "2) Найти как можно больше отказов, чтобы дефекты были идентифицированы и исправлены.\n" \
    "3) Доказать, что все возможные дефекты были найдены.\n" \
    "4) Доказать, что оставшиеся дефекты не приведут к сбоям."